---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalService.ServerChangeCause.UserChange
enum: Autodesk.Revit.DB.ExternalService.ServerChangeCause
source: html/02016116-f6cf-5d3a-94df-811ef76bdebc.htm
---
# Autodesk.Revit.DB.ExternalService.ServerChangeCause.UserChange

The change of the active server has been explicitly requested by the end user.